YUJJHH/Microcomputer_STM32F4IG_3.1-3.2/USART_RX_TX_INT.c
//////////////////////////////////////////////////////////////////////
// USART RX Interrupt 
// USART1: TX pin: PA9, RX pin: PA10 
// TX: Interrupt 방식, RX: Interrupt 방식 
// 문자를 TX를 통해 PC(Hyper terminal)로 전송하고, 
// PC에서 보내온 문자를 받아 LCD에 표시
// SW0: 5문자 연속 전송, SW1: 10문자 연속 전송, SW7: 1문자  전송
//////////////////////////////////////////////////////////////////////
#include "stm32f4xx.h"
#include "GLCD.h"

#define SW0_PUSH        0xFE00  //PH8
#define SW1_PUSH        0xFD00  //PH9
#define SW2_PUSH        0xFB00  //PH10
#define SW3_PUSH        0xF700  //PH11
#define SW4_PUSH        0xEF00  //PH12
#define SW5_PUSH        0xDF00  //PH13
#define SW6_PUSH        0xBF00  //PH14
#define SW7_PUSH        0x7F00  //PH15

void DispayTitle(void);
void _GPIO_Init(void);
void USART1_Init(void);
void USART_BRR_Configuration(uint32_t USART_BaudRate);

void SerialSendChar(uint8_t c);
void SerialSendString(char *s);

uint16_t KEY_Scan(void);
void DelayMS(unsigned short wMS);
void DelayUS(unsigned short wUS);
void BEEP(void);

int send_ch= 0x30;
int No_send_data;
uint8_t str[20];
int main(void)
{
	LCD_Init();	// LCD 구동 함수
	DelayMS(1000);	// LCD구동 딜레이
    
	_GPIO_Init();
	USART1_Init();
	GPIOG->ODR &= 0x00;	// LED0~7 Off 
          
	DispayTitle();	//LCD 초기화면구동 함수
	BEEP();
    
	while(1)
	{
		switch(KEY_Scan())
		{
			case SW0_PUSH : 		//SW0
				GPIOG->ODR |= 0x01;	// LED0 On
				No_send_data = 5;   //다섯문자보냄:데이터 수
				sprintf(str,"TX %2d bytes",No_send_data);
				LCD_DisplayText(1,0, str);
				send_ch = 0x30;    //처음문자 : 0
				USART1->CR1 |= (1<<7); 	// TXE interrupt Enable 
			break;
			case SW1_PUSH : 		//SW1
				GPIOG->ODR |= 0x02;	// LED1 On
				No_send_data = 10;
				sprintf(str,"TX %2d bytes",No_send_data);
				LCD_DisplayText(1,0, str);
				send_ch = 0x30;
				USART1->CR1 |= (1<<7); 	// TXE interrupt Enable 
			break;
			case SW7_PUSH : 		//SW7
				GPIOG->ODR &= ~0x01;	// LED1 Off
				LCD_DisplayText(1,0,"TX  1 byte ");
				send_ch = 0x30;
				No_send_data = 1;
				USART1->CR1 |= (1<<7);	// TXE interrupt Disable 
 			break;
                        
                        case SW4_PUSH : 		//SW4
				SerialSendString("q1w2");
 			break;
		}   
 	}
}

/*
void USART1_IRQHandler(void)	
{       
	// TX Buffer Empty Interrupt
	if ( (USART1->CR1 & (1<<7)) && (USART1->SR & USART_SR_TXE) )		// USART_SR_TXE=(1<<7)
	{
		USART1->CR1 &= ~(1<<7);	// 0x0080, TXE interrupt Enable    tx_ int는 조심
		
              if(1)   // 10 이상일 때
                {
              sprintf(str,"%2d",send_ch); 
		LCD_DisplayText(2,8,str);

		USART1->DR = send_ch;	// 1 byte 전송
               // USART1->DR = send_ch;	// 1 byte 전송
                
		DelayMS(500);///   실제로는 딜레이 안함
		send_ch++;
		if (send_ch < 0x61+No_send_data )   // 데이터(문자) 10byte 전송
			USART1->CR1 |= (1<<7); 	// TXE interrupt Enable 
                }
              else 
              {
               sprintf(str,"%2d",send_ch); 
		LCD_DisplayText(2,8,str);

		USART1->DR = send_ch;	// 1 byte 전송
		DelayMS(500);///   실제로는 딜레이 안함
		send_ch++;
		if (send_ch < 0x30+No_send_data )   // 데이터(문자) 10byte 전송
			USART1->CR1 |= (1<<7); 	// TXE interrupt Enable 
              }
                
                
	} 
	// RX Buffer Full interrupt
	if ( (USART1->SR & USART_SR_RXNE) )		// USART_SR_RXNE=(1<<5) 
	{
		char ch;
		ch = (uint16_t)(USART1->DR & (uint16_t)0x01FF);	// 수신된 문자 저장
		LCD_DisplayChar(3,8,ch); 	// LCD display
		// DR 을 읽으면 SR.RXNE bit(flag bit)는 clear 된다. 즉 clear 할 필요없음 
	} 
}
*/

void USART1_IRQHandler(void)	
{       
	// TX Buffer Empty Interrupt
	if ( (USART1->CR1 & (1<<7)) && (USART1->SR & USART_SR_TXE) )		// USART_SR_TXE=(1<<7)
	{
		USART1->CR1 &= ~(1<<7);	// 0x0080, TXE interrupt Enable    tx_ int는 조심
		sprintf(str,"%2d",send_ch); 
		LCD_DisplayText(2,8,str);

		USART1->DR = send_ch;	// 1 byte 전송
		DelayMS(500);///   실제로는 딜레이 안함
		send_ch++;
		if (send_ch < 0x30+No_send_data )   // 데이터(문자) 10byte 전송
			USART1->CR1 |= (1<<7); 	// TXE interrupt Enable 
	} 
	// RX Buffer Full interrupt
	if ( (USART1->SR & USART_SR_RXNE) )		// USART_SR_RXNE=(1<<5) 
	{
		char ch;
		ch = (uint16_t)(USART1->DR & (uint16_t)0x01FF);	// 수신된 문자 저장
		LCD_DisplayChar(3,8,ch); 	// LCD display
		// DR 을 읽으면 SR.RXNE bit(flag bit)는 clear 된다. 즉 clear 할 필요없음 
	} 
}

void _GPIO_Init(void)
{
	// LED (GPIO G) 설정
	RCC->AHB1ENR	|=  0x00000040;	// RCC_AHB1ENR : GPIOG(bit#6) Enable							
	GPIOG->MODER 	|=  0x00005555;	// GPIOG 0~7 : Output mode (0b01)						
	GPIOG->OTYPER	&= ~0x00FF;	// GPIOG 0~7 : Push-pull  (GP8~15:reset state)	
 	GPIOG->OSPEEDR 	|=  0x00005555;	// GPIOG 0~7 : Output speed 25MHZ Medium speed 
    
	// SW (GPIO H) 설정 
	RCC->AHB1ENR    |=  0x00000080;	// RCC_AHB1ENR : GPIOH(bit#7) Enable							
	GPIOH->MODER 	&= ~0xFFFF0000;	// GPIOH 8~15 : Input mode (reset state)				
	GPIOH->PUPDR 	&= ~0xFFFF0000;	// GPIOH 8~15 : Floating input (No Pull-up, pull-down) :reset state

	// Buzzer (GPIO F) 설정 
	RCC->AHB1ENR	|=  0x00000020; // RCC_AHB1ENR : GPIOF(bit#5) Enable							
	GPIOF->MODER 	|=  0x00040000;	// GPIOF 9 : Output mode (0b01)						
	GPIOF->OTYPER 	&= ~0x0200;	// GPIOF 9 : Push-pull  	
 	GPIOF->OSPEEDR 	|=  0x00040000;	// GPIOF 9 : Output speed 25MHZ Medium speed 
}

void USART1_Init(void)
{
	// USART1 : TX(PA9)
	RCC->AHB1ENR	|= (1<<0);	// RCC_AHB1ENR GPIOA Enable
	GPIOA->MODER	|= (2<<2*9);	// GPIOB PIN9 Output Alternate function mode					
	GPIOA->OSPEEDR	|= (3<<2*9);	// GPIOB PIN9 Output speed (100MHz Very High speed)
	GPIOA->AFR[1]	|= (7<<4);	// Connect GPIOA pin9 to AF7(USART1)
    
	// USART1 : RX(PA10)
	GPIOA->MODER 	|= (2<<2*10);	// GPIOA PIN10 Output Alternate function mode
	GPIOA->OSPEEDR	|= (3<<2*10);	// GPIOA PIN10 Output speed (100MHz Very High speed
	GPIOA->AFR[1]	|= (7<<8);	// Connect GPIOA pin10 to AF7(USART1)

	RCC->APB2ENR	|= (1<<4);	// RCC_APB2ENR USART1 Enable
    
	USART_BRR_Configuration(19200); // USART Baud rate Configuration
    
	USART1->CR1	&= ~(1<<12);	// USART_WordLength 8 Data bit
	USART1->CR1	&= ~(1<<10);	// NO USART_Parity
	USART1->CR1	|= (1<<2);	// 0x0004, USART_Mode_RX Enable
	USART1->CR1	|= (1<<3);	// 0x0008, USART_Mode_Tx Enable
	USART1->CR2	&= ~(3<<12);	// 0b00, USART_StopBits_1
	USART1->CR3	= 0x0000;	// No HardwareFlowControl, No DMA
    
	USART1->CR1	|= (1<<5);	// 0x0020, RXNE interrupt Enable
	USART1->CR1	&= ~(1<<7); // 0x0080, TXE interrupt Disable    TDR은 선언하자마자 비워있음>> 바로 tx 인터럽트 발생 >> 조심할것

	NVIC->ISER[1]	|= (1<<(37-32));// Enable Interrupt USART1 (NVIC 37번)
	USART1->CR1 	|= (1<<13);	//  0x2000, USART1 Enable
}

void SerialSendChar(uint8_t Ch) // 1문자 보내기 함수
{
	while((USART1->SR & USART_SR_TXE) == RESET); // USART_SR_TXE=(1<<7), 송신 가능한 상태까지 대기  이게 폴링방법

	USART1->DR = (Ch & 0x01FF);	// 전송 (최대 9bit 이므로 0x01FF과 masking)
}

void SerialSendString(char *str) // 여러문자 보내기 함수
{
	while (*str != '\0') // 종결문자가 나오기 전까지 구동, 종결문자가 나온후에도 구동시 메모리 오류 발생가능성 있음.
	{
		SerialSendChar(*str);	// 포인터가 가르키는 곳의 데이터를 송신
		str++; 			// 포인터 수치 증가
	}
}

// Baud rate  
void USART_BRR_Configuration(uint32_t USART_BaudRate)
{ 
	uint32_t tmpreg = 0x00;
	uint32_t APB2clock = 84000000;	//PCLK2_Frequency
	uint32_t integerdivider = 0x00;
	uint32_t fractionaldivider = 0x00;

	// Determine the integer part 
	if ((USART1->CR1 & USART_CR1_OVER8) != 0) // USART_CR1_OVER8=(1<<15)
	{                                         // USART1->CR1.OVER8 = 1 (8 oversampling)
		// Computing 'Integer part' when the oversampling mode is 8 Samples 
		integerdivider = ((25 * APB2clock) / (2 * USART_BaudRate));    
	}
	else  // USART1->CR1.OVER8 = 0 (16 oversampling)
	{	// Computing 'Integer part' when the oversampling mode is 16 Samples 
		integerdivider = ((25 * APB2clock) / (4 * USART_BaudRate));    
	}
	tmpreg = (integerdivider / 100) << 4;
  
	// Determine the fractional part 
	fractionaldivider = integerdivider - (100 * (tmpreg >> 4));

	// Implement the fractional part in the register 
	if ((USART1->CR1 & USART_CR1_OVER8) != 0)	// 8 oversampling
	{
		tmpreg |= (((fractionaldivider * 8) + 50) / 100) & (0x07);
	}
	else 			// 16 oversampling
	{
		tmpreg |= (((fractionaldivider * 16) + 50) / 100) & (0x0F);
	}

	// Write to USART BRR register
	USART1->BRR = (uint16_t)tmpreg;
}

void DispayTitle(void)
{	LCD_Clear(RGB_WHITE);
	LCD_SetFont(&Gulim8);
	LCD_SetBackColor(RGB_GREEN);	//배경색
	LCD_SetTextColor(RGB_BLACK);	//글자색
	LCD_DisplayText(0,0,"USART1");
	LCD_DisplayText(2,0,"TX data:");
	LCD_DisplayText(3,0,"RX data:");

	LCD_SetBackColor(RGB_WHITE);	//글자배경색
        
        
        
        
        
        
        
        
        
}
void DelayMS(unsigned short wMS)
{	register unsigned short i;
	for (i=0; i<wMS; i++)
		DelayUS(1000);  // 1000us => 1ms
}
void DelayUS(unsigned short wUS)
{	volatile int Dly = (int)wUS*17;
	for(; Dly; Dly--);
}
uint8_t key_flag = 0;
uint16_t KEY_Scan(void)	// input key SW0 - SW7 
{ 
	uint16_t key;
	key = GPIOH->IDR & 0xFF00;	// any key pressed ?
	if(key == 0xFF00)		// if no key, check key off
	{  	if(key_flag == 0)
        		return key;
		else
		{		DelayMS(10);
        		key_flag = 0;
        		return key;
		}
	}
  	else				// if key input, check continuous key
	{	if(key_flag != 0)	// if continuous key, treat as no key input
			return 0xFF00;
		else			// if new key,delay for debounce
		{	key_flag = 1;
			DelayMS(10);
 			return key;
		}
	}
}
void BEEP(void)			// Beep for 20 ms 
{ 	GPIOF->ODR |= (1<<9);	// PF9 'H' Buzzer on
	DelayMS(20);		// Delay 20 ms
	GPIOF->ODR &= ~(1<<9);	// PF9 'L' Buzzer off
}